# 10 Minutes to pandas

In [1]:
In [1]: import pandas as pd

In [2]: import numpy as np

import matplotlib.pyplot as plt
%pylab

Using matplotlib backend: MacOSX
Populating the interactive namespace from numpy and matplotlib

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)

dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D', tz=None)

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

df

                   A         B         C         D
2013-01-01  2.355143  2.068316 -0.270572 -0.627716
2013-01-02  0.252729  0.048002  1.649691 -2.559515
2013-01-03  0.585051 -0.627208 -2.090257 -1.173590
2013-01-04 -0.694284 -0.461730 -0.697817  1.628232
2013-01-05  1.876649 -0.262111 -0.140970 -0.009825
2013-01-06  0.427389 -0.374807  1.141019 -1.530268

In [5]:
df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.Timestamp('20130102'),
   ....:                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:                      'D' : np.array([3] * 4,dtype='int32'),
   ....:                      'E' : pd.Categorical(["test","train","test","train"]),
   ....:                      'F' : 'foo' })

In [6]:
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
df.head()

                   A         B         C         D
2013-01-01  2.355143  2.068316 -0.270572 -0.627716
2013-01-02  0.252729  0.048002  1.649691 -2.559515
2013-01-03  0.585051 -0.627208 -2.090257 -1.173590
2013-01-04 -0.694284 -0.461730 -0.697817  1.628232
2013-01-05  1.876649 -0.262111 -0.140970 -0.009825

In [9]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D', tz=None)

In [10]:
df.columns

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [11]:
df.values

array([[ 2.35514281,  2.06831562, -0.27057229, -0.62771592],
       [ 0.25272886,  0.04800167,  1.64969081, -2.55951501],
       [ 0.58505083, -0.62720759, -2.09025667, -1.17359022],
       [-0.69428403, -0.46173023, -0.69781697,  1.6282317 ],
       [ 1.87664913, -0.26211075, -0.14096978, -0.00982467],
       [ 0.4273895 , -0.37480665,  1.14101871, -1.53026804]])

In [12]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.800446  0.065077 -0.068151 -0.712114
std    1.122058  1.007034  1.337516  1.433372
min   -0.694284 -0.627208 -2.090257 -2.559515
25%    0.296394 -0.439999 -0.591006 -1.441099
50%    0.506220 -0.318459 -0.205771 -0.900653
75%    1.553750 -0.029526  0.820522 -0.164297
max    2.355143  2.068316  1.649691  1.628232

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    2.355143    0.252729    0.585051   -0.694284    1.876649    0.427389
B    2.068316    0.048002   -0.627208   -0.461730   -0.262111   -0.374807
C   -0.270572    1.649691   -2.090257   -0.697817   -0.140970    1.141019
D   -0.627716   -2.559515   -1.173590    1.628232   -0.009825   -1.530268

In [14]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.627716 -0.270572  2.068316  2.355143
2013-01-02 -2.559515  1.649691  0.048002  0.252729
2013-01-03 -1.173590 -2.090257 -0.627208  0.585051
2013-01-04  1.628232 -0.697817 -0.461730 -0.694284
2013-01-05 -0.009825 -0.140970 -0.262111  1.876649
2013-01-06 -1.530268  1.141019 -0.374807  0.427389

In [15]:
df.sort(columns='B')

                   A         B         C         D
2013-01-03  0.585051 -0.627208 -2.090257 -1.173590
2013-01-04 -0.694284 -0.461730 -0.697817  1.628232
2013-01-06  0.427389 -0.374807  1.141019 -1.530268
2013-01-05  1.876649 -0.262111 -0.140970 -0.009825
2013-01-02  0.252729  0.048002  1.649691 -2.559515
2013-01-01  2.355143  2.068316 -0.270572 -0.627716

In [16]:
df['A']

2013-01-01    2.355143
2013-01-02    0.252729
2013-01-03    0.585051
2013-01-04   -0.694284
2013-01-05    1.876649
2013-01-06    0.427389
Freq: D, Name: A, dtype: float64

In [17]:
df[0:3]

                   A         B         C         D
2013-01-01  2.355143  2.068316 -0.270572 -0.627716
2013-01-02  0.252729  0.048002  1.649691 -2.559515
2013-01-03  0.585051 -0.627208 -2.090257 -1.173590

In [18]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.252729  0.048002  1.649691 -2.559515
2013-01-03  0.585051 -0.627208 -2.090257 -1.173590
2013-01-04 -0.694284 -0.461730 -0.697817  1.628232

In [19]:
df.loc[dates[0]]

A    2.355143
B    2.068316
C   -0.270572
D   -0.627716
Name: 2013-01-01 00:00:00, dtype: float64

In [20]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  2.355143  2.068316
2013-01-02  0.252729  0.048002
2013-01-03  0.585051 -0.627208
2013-01-04 -0.694284 -0.461730
2013-01-05  1.876649 -0.262111
2013-01-06  0.427389 -0.374807

In [21]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.252729  0.048002
2013-01-03  0.585051 -0.627208
2013-01-04 -0.694284 -0.461730

In [22]:
df.loc['20130102',['A','B']]

A    0.252729
B    0.048002
Name: 2013-01-02 00:00:00, dtype: float64

In [23]:
df.loc[dates[0],'A']

2.3551428133791665

In [24]:
df.at[dates[0],'A']

2.3551428133791665

In [25]:
df.iloc[3]

A   -0.694284
B   -0.461730
C   -0.697817
D    1.628232
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.694284 -0.461730
2013-01-05  1.876649 -0.262111

In [27]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.252729  1.649691
2013-01-03  0.585051 -2.090257
2013-01-05  1.876649 -0.140970

In [28]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.252729  0.048002  1.649691 -2.559515
2013-01-03  0.585051 -0.627208 -2.090257 -1.173590

In [29]:
df.iloc[:,1:3]

                   B         C
2013-01-01  2.068316 -0.270572
2013-01-02  0.048002  1.649691
2013-01-03 -0.627208 -2.090257
2013-01-04 -0.461730 -0.697817
2013-01-05 -0.262111 -0.140970
2013-01-06 -0.374807  1.141019

In [30]:
df.iloc[1,1]

0.048001673008168336

In [31]:
df.iat[1,1]

0.048001673008168336

In [32]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  2.355143  2.068316 -0.270572 -0.627716
2013-01-02  0.252729  0.048002  1.649691 -2.559515
2013-01-03  0.585051 -0.627208 -2.090257 -1.173590
2013-01-05  1.876649 -0.262111 -0.140970 -0.009825
2013-01-06  0.427389 -0.374807  1.141019 -1.530268

In [33]:
df[df > 0]

                   A         B         C         D
2013-01-01  2.355143  2.068316       NaN       NaN
2013-01-02  0.252729  0.048002  1.649691       NaN
2013-01-03  0.585051       NaN       NaN       NaN
2013-01-04       NaN       NaN       NaN  1.628232
2013-01-05  1.876649       NaN       NaN       NaN
2013-01-06  0.427389       NaN  1.141019       NaN

In [34]:
df2 = df.copy()

df2['E'] = ['one', 'one','two','three','four','three']

df

                   A         B         C         D
2013-01-01  2.355143  2.068316 -0.270572 -0.627716
2013-01-02  0.252729  0.048002  1.649691 -2.559515
2013-01-03  0.585051 -0.627208 -2.090257 -1.173590
2013-01-04 -0.694284 -0.461730 -0.697817  1.628232
2013-01-05  1.876649 -0.262111 -0.140970 -0.009825
2013-01-06  0.427389 -0.374807  1.141019 -1.530268

In [35]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.585051 -0.627208 -2.090257 -1.173590   two
2013-01-05  1.876649 -0.262111 -0.140970 -0.009825  four

In [36]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [37]:
df.at[dates[0],'A'] = 0

In [38]:
df.iat[0,1] = 0

In [39]:
df.loc[:,'D'] = np.array([5] * len(df))

In [40]:
df

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.270572  5
2013-01-02  0.252729  0.048002  1.649691  5
2013-01-03  0.585051 -0.627208 -2.090257  5
2013-01-04 -0.694284 -0.461730 -0.697817  5
2013-01-05  1.876649 -0.262111 -0.140970  5
2013-01-06  0.427389 -0.374807  1.141019  5

In [41]:
df2 = df.copy()

df2[df2 > 0] = -df2

df2

                   A         B         C  D
2013-01-01  0.000000  0.000000 -0.270572 -5
2013-01-02 -0.252729 -0.048002 -1.649691 -5
2013-01-03 -0.585051 -0.627208 -2.090257 -5
2013-01-04 -0.694284 -0.461730 -0.697817 -5
2013-01-05 -1.876649 -0.262111 -0.140970 -5
2013-01-06 -0.427389 -0.374807 -1.141019 -5

In [42]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

df1.loc[dates[0]:dates[1],'E'] = 1

df1

                   A         B         C  D   E
2013-01-01  0.000000  0.000000 -0.270572  5   1
2013-01-02  0.252729  0.048002  1.649691  5   1
2013-01-03  0.585051 -0.627208 -2.090257  5 NaN
2013-01-04 -0.694284 -0.461730 -0.697817  5 NaN

In [43]:
df1.dropna(how='any')

                   A         B         C  D  E
2013-01-01  0.000000  0.000000 -0.270572  5  1
2013-01-02  0.252729  0.048002  1.649691  5  1

In [44]:
df1.fillna(value=5)

                   A         B         C  D  E
2013-01-01  0.000000  0.000000 -0.270572  5  1
2013-01-02  0.252729  0.048002  1.649691  5  1
2013-01-03  0.585051 -0.627208 -2.090257  5  5
2013-01-04 -0.694284 -0.461730 -0.697817  5  5

In [45]:
pd.isnull(df1)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

In [46]:
df.mean()

A    0.407922
B   -0.279642
C   -0.068151
D    5.000000
dtype: float64

In [47]:
df.mean(1)

2013-01-01    1.182357
2013-01-02    1.737605
2013-01-03    0.716897
2013-01-04    0.786542
2013-01-05    1.618392
2013-01-06    1.548400
Freq: D, dtype: float64

In [48]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

s

2013-01-01   NaN
2013-01-02   NaN
2013-01-03     1
2013-01-04     3
2013-01-05     5
2013-01-06   NaN
Freq: D, dtype: float64

In [49]:
df.sub(s, axis='index')

                   A         B         C   D
2013-01-01       NaN       NaN       NaN NaN
2013-01-02       NaN       NaN       NaN NaN
2013-01-03 -0.414949 -1.627208 -3.090257   4
2013-01-04 -3.694284 -3.461730 -3.697817   2
2013-01-05 -3.123351 -5.262111 -5.140970   0
2013-01-06       NaN       NaN       NaN NaN

In [50]:
df.apply(np.cumsum)

                   A         B         C   D
2013-01-01  0.000000  0.000000 -0.270572   5
2013-01-02  0.252729  0.048002  1.379119  10
2013-01-03  0.837780 -0.579206 -0.711138  15
2013-01-04  0.143496 -1.040936 -1.408955  20
2013-01-05  2.020145 -1.303047 -1.549925  25
2013-01-06  2.447534 -1.677854 -0.408906  30

In [51]:
df.apply(lambda x: x.max() - x.min())

A    2.570933
B    0.675209
C    3.739947
D    0.000000
dtype: float64

In [52]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    6
1    5
2    5
3    6
4    6
5    5
6    5
7    5
8    5
9    3
dtype: int64

In [53]:
s.value_counts()

5    6
6    3
3    1
dtype: int64

In [54]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [55]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.768378 -0.252865 -0.456409 -0.904441
1 -0.013102 -1.393442 -1.471195  0.748152
2 -0.882314 -1.074019 -1.181812 -0.635034
3  0.589646 -0.784134  0.985564  1.252461
4 -0.363719  0.539363  1.432316  0.423990
5 -0.230635  0.645998  0.736992  0.696615
6  0.959331 -0.207257 -0.727273  2.935703
7 -1.402653 -1.722244 -0.033482  0.478807
8  0.129641 -1.555837 -0.030046  0.029955
9 -0.057014  1.123617 -0.102209  1.567234

In [56]:
pieces = [df[:3], df[3:7], df[7:]]

pd.concat(pieces)

          0         1         2         3
0 -0.768378 -0.252865 -0.456409 -0.904441
1 -0.013102 -1.393442 -1.471195  0.748152
2 -0.882314 -1.074019 -1.181812 -0.635034
3  0.589646 -0.784134  0.985564  1.252461
4 -0.363719  0.539363  1.432316  0.423990
5 -0.230635  0.645998  0.736992  0.696615
6  0.959331 -0.207257 -0.727273  2.935703
7 -1.402653 -1.722244 -0.033482  0.478807
8  0.129641 -1.555837 -0.030046  0.029955
9 -0.057014  1.123617 -0.102209  1.567234

In [57]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

left

   key  lval
0  foo     1
1  foo     2

In [58]:
right

   key  rval
0  foo     4
1  foo     5

In [59]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [60]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

df

          A         B         C         D
0  0.296973 -0.349317 -0.937893  0.007990
1  0.459522 -0.561628  1.182133 -1.719712
2  0.076053  1.298041 -0.811843 -0.923321
3  1.560974  0.138621 -1.403566 -1.169464
4 -1.763560 -0.705367  0.362665 -1.097434
5  0.524073  0.605079  1.409762 -0.159854
6  1.244731 -0.727519 -1.345358  1.351251
7 -0.519889 -1.974129  0.972142  0.827276

In [61]:
s = df.iloc[3]

df.append(s, ignore_index=True)

          A         B         C         D
0  0.296973 -0.349317 -0.937893  0.007990
1  0.459522 -0.561628  1.182133 -1.719712
2  0.076053  1.298041 -0.811843 -0.923321
3  1.560974  0.138621 -1.403566 -1.169464
4 -1.763560 -0.705367  0.362665 -1.097434
5  0.524073  0.605079  1.409762 -0.159854
6  1.244731 -0.727519 -1.345358  1.351251
7 -0.519889 -1.974129  0.972142  0.827276
8  1.560974  0.138621 -1.403566 -1.169464

In [62]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                           'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                           'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})

In [63]:
df

     A      B         C         D
0  foo    one -0.478235 -0.397135
1  bar    one -0.752964 -0.204155
2  foo    two  1.247981  2.185690
3  bar  three -1.811657  0.037146
4  foo    two -1.450935  0.936014
5  bar    two -0.759934 -0.179329
6  foo    one -0.673935 -0.253505
7  foo  three  0.672678  0.177839

In [64]:
df.groupby('A').sum()

            C         D
A
bar -3.324556 -0.346339
foo -0.682445  2.648903

In [65]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.752964 -0.204155
    three -1.811657  0.037146
    two   -0.759934 -0.179329
foo one   -1.152170 -0.650640
    three  0.672678  0.177839
    two   -0.202954  3.121704

In [66]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))
   ....: 

index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

df2 = df[:4]

df2

                     A         B
first second
bar   one    -0.451827  0.311627
      two     0.871269  0.348626
baz   one     1.600967 -1.443530
      two     0.349774  0.328481

In [67]:
stacked = df2.stack()

stacked

first  second
bar    one     A   -0.451827
               B    0.311627
       two     A    0.871269
               B    0.348626
baz    one     A    1.600967
               B   -1.443530
       two     A    0.349774
               B    0.328481
dtype: float64

In [68]:
stacked.unstack()

                     A         B
first second
bar   one    -0.451827  0.311627
      two     0.871269  0.348626
baz   one     1.600967 -1.443530
      two     0.349774  0.328481

In [69]:
stacked.unstack(1)

second        one       two
first
bar   A -0.451827  0.871269
      B  0.311627  0.348626
baz   A  1.600967  0.349774
      B -1.443530  0.328481

In [70]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.451827  1.600967
       B  0.311627 -1.443530
two    A  0.871269  0.349774
       B  0.348626  0.328481

In [71]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
   .....:                    'B' : ['A', 'B', 'C'] * 4,
   .....:                    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
   .....:                    'D' : np.random.randn(12),
   .....:                    'E' : np.random.randn(12)})

In [72]:
df

        A  B    C         D         E
0     one  A  foo -0.877822  1.096714
1     one  B  foo -0.041001  0.887155
2     two  C  foo -0.788368 -0.768552
3   three  A  bar -1.321108  0.248701
4     one  B  bar  0.153666 -0.734661
5     one  C  bar -0.423421  0.359524
6     two  A  foo  1.149874 -0.194797
7   three  B  foo  0.474315  2.033269
8     one  C  foo  0.048239  1.966609
9     one  A  bar  0.515046 -0.660789
10    two  B  bar -0.573073 -0.307792
11  three  C  bar  0.769999 -0.086408

In [73]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.515046 -0.877822
      B  0.153666 -0.041001
      C -0.423421  0.048239
three A -1.321108       NaN
      B       NaN  0.474315
      C  0.769999       NaN
two   A       NaN  1.149874
      B -0.573073       NaN
      C       NaN -0.788368

In [74]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample('5Min', how='sum')

2012-01-01    23536
Freq: 5T, dtype: int64

In [75]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

ts = pd.Series(np.random.randn(len(rng)), rng)

ts

2012-03-06   -1.871493
2012-03-07   -2.462724
2012-03-08    1.029050
2012-03-09    0.517974
2012-03-10   -1.831393
Freq: D, dtype: float64

In [76]:
ts_utc = ts.tz_localize('UTC')

ts_utc

2012-03-06 00:00:00+00:00   -1.871493
2012-03-07 00:00:00+00:00   -2.462724
2012-03-08 00:00:00+00:00    1.029050
2012-03-09 00:00:00+00:00    0.517974
2012-03-10 00:00:00+00:00   -1.831393
Freq: D, dtype: float64

In [77]:
 ts_utc.tz_convert('US/Eastern')

2012-03-05 19:00:00-05:00   -1.871493
2012-03-06 19:00:00-05:00   -2.462724
2012-03-07 19:00:00-05:00    1.029050
2012-03-08 19:00:00-05:00    0.517974
2012-03-09 19:00:00-05:00   -1.831393
Freq: D, dtype: float64

In [78]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

ts = pd.Series(np.random.randn(len(rng)), index=rng)

ts

2012-01-31    0.012349
2012-02-29    0.118432
2012-03-31   -0.983623
2012-04-30   -0.463472
2012-05-31    1.381035
Freq: M, dtype: float64

In [79]:
ps = ts.to_period()

ps

2012-01    0.012349
2012-02    0.118432
2012-03   -0.983623
2012-04   -0.463472
2012-05    1.381035
Freq: M, dtype: float64

In [80]:
ps.to_timestamp()

2012-01-01    0.012349
2012-02-01    0.118432
2012-03-01   -0.983623
2012-04-01   -0.463472
2012-05-01    1.381035
Freq: MS, dtype: float64

In [81]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')

ts = pd.Series(np.random.randn(len(prng)), prng)

ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9

ts.head()

1990-03-01 09:00    0.856230
1990-06-01 09:00    0.891576
1990-09-01 09:00    1.015326
1990-12-01 09:00    0.816399
1991-03-01 09:00   -0.403452
Freq: H, dtype: float64

In [82]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})

In [83]:
df["grade"] = df["raw_grade"].astype("category")

df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [84]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [85]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [86]:
df.sort("grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [87]:
df.groupby("grade").size()

grade
very bad      1
bad         NaN
medium      NaN
good          2
very good     3
dtype: float64

In [102]:
%matplotlib inline
import matplotlib.pyplot as plt

In [103]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))

ts = ts.cumsum()

In [104]:
fig=plt.figure()

In [105]:
ax1=fig.add_subplot(1,1,1)
ax1

In [ ]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index,columns=['A', 'B', 'C', 'D']) 
df = df.cumsum()
plt.figure();df.plot(); plt.legend(loc='best')

In [97]:
df.to_csv('foo.csv')

In [98]:
pd.read_csv('foo.csv')

   Unnamed: 0  id raw_grade      grade
0           0   1         a  very good
1           1   2         b       good
2           2   3         b       good
3           3   4         a  very good
4           4   5         a  very good
5           5   6         e   very bad